packages/Webkul/Notification/src/Http/Controllers/Admin/NotificationController.php

    public function getNotifications()
    {
        if (auth()->guard('admin')->user()->role_id != 1) {
            $p_ids = DB::table('products')->where('user_id', auth()->guard('admin')->user()->role_id)->pluck('id');

            $o_ids = DB::table('order_items')->whereIn('product_id', $p_ids)->pluck('order_id');
        }
        else{
            $o_ids = DB::table('orders')->pluck('id');
        }
        $params = request()->all();

        if (isset($params['page'])) {
            unset($params['page']);
        }

        if (count($params)) {
            $searchResults = $this->notificationRepository->getParamsData($params);
        } else {
            $searchResults = $this->notificationRepository->with('order')->latest()->paginate(10);
        }

        return [
            'search_results' => $searchResults,
            'total_unread'   => $this->notificationRepository->where('read', 0)->count(),
        ];
---
select `id` from `orders`
select count(*) as aggregate from `notifications` where `read` = 0
select count(*) as aggregate from `notifications` where `order_id` in (1) and `read` = '0' and `read` = 0 limit 5 offset 0