packages/Webkul/Product/src/Models/Product.php

select * from `product_attribute_values` where `product_attribute_values`.`product_id` = 1 and `product_attribute_values`.`product_id` is not null and `channel` = 'default' and `locale` = 'en' and `attribute_id` = 2 limit 1
select * from `product_attribute_values` where `product_attribute_values`.`product_id` = 3 and `product_attribute_values`.`product_id` is not null and `channel` = 'default' and `attribute_id` = 14 limit 1
---
    public function getCustomAttributeValue($attribute)
    {
        if (! $attribute) {
            return;
        }

        $locale = core()->checkRequestedLocaleCodeInRequestedChannel();
        $channel = core()->getRequestedChannelCode();

        if (array_key_exists($this->id, self::$loadedAttributeValues)
            && array_key_exists($attribute->id, self::$loadedAttributeValues[$this->id])) {
            return self::$loadedAttributeValues[$this->id][$attribute->id];
        }

        if ($attribute->value_per_channel) {
            if ($attribute->value_per_locale) {
                $attributeValue = $this->attribute_values()
                    ->where('channel', $channel)
                    ->where('locale', $locale)
                    ->where('attribute_id', $attribute->id)
                    ->first();
            } else {
                $attributeValue = $this->attribute_values()
                    ->where('channel', $channel)
                    ->where('attribute_id', $attribute->id)
                    ->first();

select * from `product_attribute_values` where `product_attribute_values`.`product_id` = 3 and `product_attribute_values`.`product_id` is not null and `attribute_id` = 11 limit 1
---
                    ->where('attribute_id', $attribute->id)
                    ->first();
            } else {
                $attributeValue = $this->attribute_values()
                    ->where('attribute_id', $attribute->id)
                    ->first();