packages/Webkul/Checkout/src/Models/Cart.php

select * from `addresses` where `addresses`.`cart_id` = 3 and `addresses`.`cart_id` is not null and `address_type` = 'cart_shipping' and `address_type` in ('cart_billing', 'cart_shipping') limit 1
---
    public function shipping_address(): \Illuminate\Database\Eloquent\Relations\HasMany
    {
        return $this->addresses()
                    ->where('address_type', CartAddress::ADDRESS_TYPE_SHIPPING);