packages/Webkul/Admin/src/Http/Controllers/DashboardController.php

    public function getTopSellingCategories()
    {
        if(auth()->guard('admin')->user()->role_id==1){

        return $this->orderItemRepository->getModel()
            ->leftJoin('products', 'order_items.product_id', 'products.id')
            ->leftJoin('product_categories', 'products.id', 'product_categories.product_id')
            ->leftJoin('categories', 'product_categories.category_id', 'categories.id')
            ->leftJoin('category_translations', 'categories.id', 'category_translations.category_id')
            ->where('category_translations.locale', app()->getLocale())
            ->where('order_items.created_at', '>=', $this->startDate)
            ->where('order_items.created_at', '<=', $this->endDate)
            ->addSelect(DB::raw('SUM(qty_invoiced - qty_refunded) as total_qty_invoiced'))
            ->addSelect(DB::raw('COUNT(' . DB::getTablePrefix() . 'products.id) as total_products'))
            ->addSelect('order_items.id', 'categories.id as category_id', 'category_translations.name')
            ->groupBy('categories.id')
            ->havingRaw('SUM(qty_invoiced - qty_refunded) > 0')
            ->orderBy('total_qty_invoiced', 'DESC')
            ->limit(5)
            ->get();
---
select SUM(qty_invoiced - qty_refunded) as total_qty_invoiced, COUNT(products.id) as total_products, `order_items`.`id`, `categories`.`id` as `category_id`, `category_translations`.`name` from `order_items` left join `products` on `order_items`.`product_id` = `products`.`id` left join `product_categories` on `products`.`id` = `product_categories`.`product_id` left join `categories` on `product_categories`.`category_id` = `categories`.`id` left join `category_translations` on `categories`.`id` = `category_translations`.`category_id` where `category_translations`.`locale` = 'en' and `order_items`.`created_at` >= '2022-07-11 00:00:01' and `order_items`.`created_at` <= '2022-08-10 12:36:39' group by `categories`.`id` having SUM(qty_invoiced - qty_refunded) > 0 order by `total_qty_invoiced` desc limit 5