packages/Webkul/Product/src/Type/AbstractType.php

select * from `product_ordered_inventories` where `product_ordered_inventories`.`product_id` = 1 and `product_ordered_inventories`.`product_id` is not null and `channel_id` = 1 limit 1
---
    public function totalQuantity()
    {
        $total = 0;

        $channelInventorySourceIds = app(InventorySourceRepository::class)->getChannelInventorySourceIds();

        $productInventories = $this->productInventoryRepository->checkInLoadedProductInventories($this->product);

        foreach ($productInventories as $inventory) {
            if (is_numeric($channelInventorySourceIds->search($inventory->inventory_source_id))) {
                $total += $inventory->qty;
            }
        }

        $orderedInventory = $this->product->ordered_inventories()
            ->where('channel_id', core()->getCurrentChannel()->id)->first();