packages/Webkul/Notification/src/Repositories/NotificationRepository.php

    public function getParamsData($params)
    {
        if (auth()->guard('admin')->user()->role_id != 1) {
            $p_ids = DB::table('products')->where('user_id', auth()->guard('admin')->user()->id)->pluck('id');

            $o_ids = DB::table('order_items')->whereIn('product_id', $p_ids)->pluck('order_id');
        }
        else{
            $o_ids = DB::table('orders')->pluck('id');
        }
        $this->model = $this->model->whereIn('order_id',$o_ids);
        if (isset($params['id']) && isset($params['status'])) {
            return $params['status'] != 'All' ? $this->model->where(function($qry) use ($params) {
                    $qry->whereHas('order',function ($q) use ($params) {
                        $q->where(['status' => $params['status']]);
                    });
                })->where('order_id', $params['id'])->with('order')->paginate(10)  : $this->model->where('order_id', $params['id'])->with('order')->paginate(10) ;
        } else if (isset($params['status'])) {
            return $params['status'] != 'All' ? $this->model->where(function($qry) use ($params) {
                $qry->whereHas('order',function ($q) use ($params) {
                    $q->where(['status' => $params['status']]);
                });
            })->with('order')->paginate(10): $this->model->with('order')->latest()->paginate(10);
        } else if(isset($params['read']) && isset($params['limit'])) {
            return $this->model->where('read', $params['read'])->limit($params['limit'])->with('order')->latest()->paginate($params['limit']);
---
select `id` from `orders`
select * from `orders` where `orders`.`id` in (1)